Revit 2027 API
CylindricalSurface.XDir Property
 X axis of the local coordinate system associated with this cylinder.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ XDir { get; }
Public ReadOnly Property XDir As XYZ
	Get
public:
property XYZ^ XDir {
	XYZ^ get ();
}
member XDir : XYZ with get
Property Value
XYZ
See Also
Reference
CylindricalSurface Class
Autodesk.Revit.DB Namespace